byte pin[7] = {11,10,7,8,9,12,13}; // A B C D E F G
byte A[10][7] = {
    {1,1,1,1,1,1,0},//0
    {0,1,1,0,0,0,0},//1
    {1,1,0,1,1,0,1},//2
    {1,1,1,1,0,0,1},//3
    {0,1,1,0,0,1,1},//4
    {1,0,1,1,0,1,1},//5
    {1,0,1,1,1,1,1},//6
    {1,1,1,0,0,0,0},//7
    {1,1,1,1,1,1,1},//8
    {1,1,1,1,0,1,1},//9
};

byte j;
int value; // змінна для зберігання значення освітленості

void setup() {
    for(j = 0; j <=6; j++) {
        pinMode(pin[j], OUTPUT);
    }

    on(6);
}

void loop(){
     // Регулювання через потенціометр
    value = map(analogRead(A0), 0, 1023, 0, 9);
    on(value);
    delay(2000);
 
}

void on (byte n) {
    for(j = 0;  j<=6; j++) {
        digitalWrite(pin[j], A[n][j]);
    }
}